import numpy as np

a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
print(a)
# [[1 2 3]
#  [4 5 6]
#  [7 8 9]]
#########################ndarray属性#########################
#########################1.ndarray.T进行数组转置#########################
print(a.T)
print(a.transpose())
# [[1 4 7]
#  [2 5 8]
#  [3 6 9]]
#########################2.ndarray.dtype返回数组类型#########################
print(a.dtype)
# int32
#########################3.ndarray.imag返回数组包含元素的虚部#########################
print(a.imag)
# [[0 0 0]
#  [0 0 0]
#  [0 0 0]]
#########################4.ndarray.real返回数组包含元素的实部#########################
print(a.real)
# [[1 2 3]
#  [4 5 6]
#  [7 8 9]]
#########################5.ndarray.size返回数组包含元素总数#########################
print(a.size)
# 9
#########################6.ndarray.itemsize返回一个数组元素字节数#########################
print(a.itemsize)
# 4
#########################7.ndarray.nbytes返回数组总字节数#########################
print(a.nbytes)
# 36
#########################8.ndarray.ndim返回数组维度#########################
print(a.ndim)
# 2
#########################9.ndarray.shape返回数组形状#########################
print(a.shape)
# (3, 3)
#########################10.ndarray.strides用来遍历数组时，输出每个维度中步进的字节数组#########################
print(a.strides)
# (12, 4)
